### * Single Dimensional Data Structures: Series Objects
### * Multi-Dimensional Data Structures: Data Frame

In [1]:
import pandas as pd

## Series Objects are one-dimensional labeled array. As you can see belowe. They are just like array, however they have labels associated with the elements.

In [2]:
s1 = pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
type(s1)

pandas.core.series.Series

In [4]:
# Changing the index of the series

s2 = pd.Series([1,2,3,4], index = ['a','b','c','d'])

In [5]:
s2

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
# Dictionaries

s3 = pd.Series({'a': 10, 'b': 18, 'c': 24})

In [7]:
s3

a    10
b    18
c    24
dtype: int64

In [8]:
s4 = pd.Series({'a': [10, 20, 30, 40], 'b': [18, 36, 54, 72], 'c': [24, 48, 72, 96]})

In [9]:
s4

a    [10, 20, 30, 40]
b    [18, 36, 54, 72]
c    [24, 48, 72, 96]
dtype: object

In [10]:
# Changing Index Positions

s5 = pd.Series({'a': [10, 20, 30, 40], 'b': [18, 36, 54, 72], 'c': [24, 48, 72, 96]}, index = ['a', 'c', 'd', 'b'])

In [11]:
s5

a    [10, 20, 30, 40]
c    [24, 48, 72, 96]
d                 NaN
b    [18, 36, 54, 72]
dtype: object

In [12]:
# Extracting Elements from series
s1 = pd.Series([1,2,3,4,5])
s1[3]

4

In [14]:
s1[:4]

0    1
1    2
2    3
3    4
dtype: int64

In [15]:
s1[::2]

0    1
2    3
4    5
dtype: int64

In [16]:
s1[-3:]

2    3
3    4
4    5
dtype: int64

## Scalar operations can be performed in series just like arrays.

In [17]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
s1+5

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [19]:
s1*2

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [20]:
s1/2

0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
dtype: float64

In [21]:
s1-1

0    0
1    1
2    2
3    3
4    4
dtype: int64

### Series Mathematical Operations

In [22]:
s3 = pd.Series([10,12,14,16,18])
s4 = pd.Series([10,11,12,13,14])

In [23]:
s3-s4

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [24]:
s3+s4

0    20
1    23
2    26
3    29
4    32
dtype: int64

In [25]:
s3 *s4

0    100
1    132
2    168
3    208
4    252
dtype: int64

In [26]:
s3/s4

0    1.000000
1    1.090909
2    1.166667
3    1.230769
4    1.285714
dtype: float64

In [27]:
s3//s4

0    1
1    1
2    1
3    1
4    1
dtype: int64

In [28]:
s3%s4

0    0
1    1
2    2
3    3
4    4
dtype: int64

## DataFrame is a 2-dimensional labelled data structure

In [29]:
# Creating a dataframe with index value

df1 = pd.DataFrame({'Name':['Karn','Sonu','Arjun', 'Lalit', 'Sukhdev'], 'Age': [21,19,24, 23, 21], 'Marks': [78,89,45, 98, 76]}, index = ['a', 'b', 'c', 'd', 'e'])

In [30]:
df1

      Name  Age  Marks
a     Karn   21     78
b     Sonu   19     89
c    Arjun   24     45
d    Lalit   23     98
e  Sukhdev   21     76

In [31]:
type(df1)

pandas.core.frame.DataFrame

In [32]:
df1.head()

      Name  Age  Marks
a     Karn   21     78
b     Sonu   19     89
c    Arjun   24     45
d    Lalit   23     98
e  Sukhdev   21     76

In [33]:
df1.tail()

      Name  Age  Marks
a     Karn   21     78
b     Sonu   19     89
c    Arjun   24     45
d    Lalit   23     98
e  Sukhdev   21     76

In [34]:
df1.describe()

             Age      Marks
count   5.000000   5.000000
mean   21.600000  77.200000
std     1.949359  20.067386
min    19.000000  45.000000
25%    21.000000  76.000000
50%    21.000000  78.000000
75%    23.000000  89.000000
max    24.000000  98.000000

In [35]:
df1.shape

(5, 3)

### Iloc Function

In [36]:
# Extraction of elements df.iloc[row, column]

df1.iloc[0,1]

21

In [37]:
# Extraction of row
df1.iloc[0]

Name     Karn
Age        21
Marks      78
Name: a, dtype: object

In [38]:
# Extraction of column 
df1.iloc[:,1]

a    21
b    19
c    24
d    23
e    21
Name: Age, dtype: int64

In [39]:
# Extraction a matrix from dataframe
df1.iloc[0:3, 1:3]

   Age  Marks
a   21     78
b   19     89
c   24     45

### Loc Function: Extracting rows(Only if you have given index number, other you can use just (0:2; this is the only case where two is inclusive)) and columns by sepcifying name

In [40]:
df1.loc[('a', 'b'), ('Marks', 'Age')]

   Marks  Age
a     78   21
b     89   19

In [41]:
# Dropping a column

df1.drop(labels = 'Marks', axis = 1)

      Name  Age
a     Karn   21
b     Sonu   19
c    Arjun   24
d    Lalit   23
e  Sukhdev   21

In [42]:
df1.drop(labels = ['Marks', 'Age'], axis = 1)

      Name
a     Karn
b     Sonu
c    Arjun
d    Lalit
e  Sukhdev

In [43]:
#Dropping Rows

df1.drop(labels ='a', axis = 0)

      Name  Age  Marks
b     Sonu   19     89
c    Arjun   24     45
d    Lalit   23     98
e  Sukhdev   21     76

In [44]:
df1.drop(labels = ['a', 'e'], axis = 0)

    Name  Age  Marks
b   Sonu   19     89
c  Arjun   24     45
d  Lalit   23     98

In [45]:
df1.mean()

Age      21.6
Marks    77.2
dtype: float64

In [46]:
df1.min()

Name     Arjun
Age         19
Marks       45
dtype: object

In [47]:
df1.max()

Name     Sukhdev
Age           24
Marks         98
dtype: object

In [48]:
df1.median()

Age      21.0
Marks    78.0
dtype: float64

In [49]:
df1['Age']

a    21
b    19
c    24
d    23
e    21
Name: Age, dtype: int64

In [51]:
df1

      Name  Age  Marks
a     Karn   21     78
b     Sonu   19     89
c    Arjun   24     45
d    Lalit   23     98
e  Sukhdev   21     76

In [55]:
df1['Age']

a    21
b    19
c    24
d    23
e    21
Name: Age, dtype: int64

In [56]:
df1[['Age', 'Marks']]

   Age  Marks
a   21     78
b   19     89
c   24     45
d   23     98
e   21     76

In [62]:
df1.loc[:,('Age', 'Marks')]

   Age  Marks
a   21     78
b   19     89
c   24     45
d   23     98
e   21     76